Revit 2027 API
RebarFreeFormAccessor.DisconnectFromServer Method
 Sets the GUID of the API server to invalid value and removes all the server related data from the Rebar (ex. the current constraints and the handle tags are removed). Calling this method will result in a Rebar that will not react to host changes anymore, however it will still have all the properties that it used to have.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void DisconnectFromServer()
Public Sub DisconnectFromServer
public:
void DisconnectFromServer()
member DisconnectFromServer : unit -> unit
Exceptions
Exception | Condition
InvalidOperationException |  This RebarFreeFormAccessor doesn't contain a valid rebar reference.
See Also
Reference
RebarFreeFormAccessor Class
Autodesk.Revit.DB.Structure Namespace